<a href="https://colab.research.google.com/github/neerajthandayan/CourseProject/blob/main/Police_Strength_Data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
# Loading Libraries

import pandas as pd
import numpy as np

In [2]:
df = pd.read_excel('https://assets.publishing.service.gov.uk/government/uploads/system/uploads/attachment_data/file/115758/hosb1311-tabs.xls', sheet_name='Table 8', header=4)
df = df.iloc[:43,:-6]
df.head(5)

          Unnamed: 0  ...  Chinese or Other ethnic group.1
0  Avon and Somerset  ...                              2.0
1       Bedfordshire  ...                              0.0
2     Cambridgeshire  ...                              0.0
3           Cheshire  ...                              0.0
4          Cleveland  ...                              1.0

[5 rows x 13 columns]

In [3]:
sum = pd.DataFrame(df.iloc[:,1:6].values + df.iloc[:,8:].values)
pdiv = pd.concat([df['Unnamed: 0'],sum], axis=1)
pdiv.columns = ['Geography','White','Mixed','Asian','Black','Other']
pdiv = pdiv[['Geography','White', 'Black', 'Asian', 'Other', 'Mixed']]
pdiv.iloc[:,1:] = round(pdiv.iloc[:,1:],0)
pdiv.head()

           Geography   White  Black  Asian  Other  Mixed
0  Avon and Somerset  3150.0    9.0   18.0   11.0   19.0
1       Bedfordshire  1124.0   38.0   14.0    0.0   18.0
2     Cambridgeshire  1352.0   10.0    6.0    3.0   12.0
3           Cheshire  2044.0    5.0    2.0    2.0   14.0
4          Cleveland  1567.0   19.0    1.0    2.0    6.0

In [4]:
total = pdiv.iloc[:,1:].sum(axis=1)

for i in pdiv.columns[1:]:
  pdiv[i] = pdiv[i].copy() / total

pdiv.head()

           Geography     White     Black     Asian     Other     Mixed
0  Avon and Somerset  0.982226  0.002806  0.005613  0.003430  0.005925
1       Bedfordshire  0.941374  0.031826  0.011725  0.000000  0.015075
2     Cambridgeshire  0.977585  0.007231  0.004338  0.002169  0.008677
3           Cheshire  0.988873  0.002419  0.000968  0.000968  0.006773
4          Cleveland  0.982445  0.011912  0.000627  0.001254  0.003762

In [5]:
pdiv.iloc[:,1:] = np.square((0.5-pdiv.iloc[:,1:].copy().values)/0.5)*pdiv.iloc[:,1:].copy()
pdiv.head()

           Geography     White     Black     Asian     Other     Mixed
0  Avon and Somerset  0.913637  0.002775  0.005487  0.003383  0.005785
1       Bedfordshire  0.733558  0.027903  0.011182  0.000000  0.014180
2     Cambridgeshire  0.891899  0.007023  0.004263  0.002150  0.008378
3           Cheshire  0.945349  0.002396  0.000964  0.000964  0.006591
4          Cleveland  0.914669  0.011351  0.000625  0.001248  0.003705

In [6]:
# Using Polarity Index to Measure Diversity

pdiv['PD_Diversity'] = 1 - pdiv.iloc[:,1:].sum(axis=1)
police_div = pdiv[['Geography','PD_Diversity']]
police_div.sort_values(by='PD_Diversity',ascending=False).head()

              Geography  PD_Diversity
22  Metropolitan Police      0.324189
36        West Midlands      0.288414
18       Leicestershire      0.245159
1          Bedfordshire      0.213177
20      London, City of      0.210564

In [7]:
# Creating Csv file for Police Diversity

police_div.to_csv('police_diversity.csv')